## Desafio 02. Localizações vazias

### Bibliotecas

In [1]:
import pandas as pd

# Módulo de conexão com banco
import sys
sys.path.append('../') 
import funcoesconexao as con

# Desativa warnings
import warnings
warnings.filterwarnings('ignore')

### Carregamento dos Dados

#### Via banco de dados — SQL Server

In [2]:
conexao = con.conectar_bd()

----- Conexão com banco de dados estabelecida com sucesso! -----

In [3]:
# Carregando dataframes
df_localizacoes = con.carregar_dados(conexao, 'localizacoes')
df_usuarios     = con.carregar_dados(conexao, 'usuarios')

# Fechando conexão
con.fechar_conexao_bd(conexao)

In [4]:
# Exibindo dataframes
display(df_localizacoes.head())
display(df_usuarios.head())

   id             nome  cidade_id
0   1        Pinheiros          1
1   2    Vila Madalena          1
2   3       Copacabana          2
3   4  Barra da Tijuca          2
4   5          Savassi          3

,id,nome,data_criacao,localizacao_id,email
0,1,João Silva,2019-10-15,1,joao.silva@empresa.com
1,2,Maria Souza,2019-10-15,2,maria.souza@empresa.com
2,3,Carlos Oliveira,2019-10-15,3,carlos.oliveira@empresa.com
3,4,Ana Pereira,2019-10-15,1,ana.pereira@empresa.com
4,5,Pedro Costa,2019-10-15,2,pedro.costa@empresa.com

#### Via arquivo .CSV

In [5]:
# Carregando dataframes
df_localizacoes = con.carregar_dados_csv('localizacoes.csv')
df_usuarios     = con.carregar_dados_csv('usuarios.csv')

In [6]:
# Exibindo dataframes
display(df_localizacoes.head())
display(df_usuarios.head())

   id             nome  cidade_id
0   1        Pinheiros          1
1   2    Vila Madalena          1
2   3       Copacabana          2
3   4  Barra da Tijuca          2
4   5          Savassi          3

,id,nome,data_criacao,localizacao_id,email
0,1,João Silva,2019-10-15 00:00:00.000,1,joao.silva@empresa.com
1,2,Maria Souza,2019-10-15 00:00:00.000,2,maria.souza@empresa.com
2,3,Carlos Oliveira,2019-10-15 00:00:00.000,3,carlos.oliveira@empresa.com
3,4,Ana Pereira,2019-10-15 00:00:00.000,1,ana.pereira@empresa.com
4,5,Pedro Costa,2019-10-15 00:00:00.000,2,pedro.costa@empresa.com

### Solução

In [7]:
def localizacoes_vazias(localizacoes: pd.DataFrame, usuarios: pd.DataFrame):
    # Mesclando dataframes
    df_merge = pd.merge(localizacoes, usuarios, left_on='id', right_on='localizacao_id', how='left')
    
    # Agrupando por Localização
    df_agrupado = df_merge.groupby('nome_x').count()
    
    # Filtrando apenas localizações vazias
    lista_localizacoes_vazias = sorted(df_agrupado[df_agrupado['id_y'] == 0].index.tolist())
    
    # Convertendo lista em dataframe
    df = pd.DataFrame({'nome': lista_localizacoes_vazias})
    
    # Saída
    return df

In [8]:
localizacoes_vazias(df_localizacoes, df_usuarios)

             nome
0      Guararapes
1       Itaparica
2          Itapuã
3  Jardim Camburi
4         Savassi